---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.CategoryId
source: html/facb8291-71f9-a9b5-4abf-6389a5401136.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.CategoryId Property

The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```